In [7]:
from data_loader import DATA_RAW

In [8]:
dat = DATA_RAW(n_question=1223,
                   seqlen=2000, separate_char=',')

In [9]:
data_path = './data/assist2009_raw/skill_builder_data_corrected.csv'

In [10]:
 all_data = dat.get_processed_data(data_path)

Load data from pickle file...
Max step: 1295
Num of skills: 123
Num of students: 4163

In [ ]:
all_data

In [11]:
students,  skills, max_steps= dat.load_raw_data(data_path)

Load data from pickle file...
Max step: 1295
Num of skills: 123
Num of students: 4163

In [ ]:
students

In [12]:
pickle_data = {}
students = {}
students_list = []
skills = []
users_id = []
max_steps = -1
min_steps = float('inf')
features = ['assignment_id', 'assistment_id', 'problem_id', 'user_id', 'original', 'correct', 'attempt_count',
            'ms_first_response',
            'skill_id', 'hint_count', 'hint_total', 'first_action', 'bottom_hint']

selected_features = ['skill_id', 'correct',
                        'user_id', 'ms_first_response', 'attempt_count', 'hint_count']

In [13]:
import pandas as pd
file_name = './data/assist2009_raw/skill_builder_data_corrected.csv'
all_data = pd.read_csv(file_name, encoding='ISO-8859-1')
filtered_data = all_data[features]
filtered_data = filtered_data[filtered_data['ms_first_response'] > 0]
filtered_data = filtered_data.fillna(-1)

/Users/maywzh/.pyenv/versions/3.8.6/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3155: DtypeWarning: Columns (17) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,assignment_id,assistment_id,problem_id,user_id,original,correct,attempt_count,ms_first_response,skill_id,hint_count,hint_total,first_action,bottom_hint
0,277618,33139,51424,64525,1,1,1,32454,1.0,0,3,0,-1.0
1,277618,33150,51435,64525,1,1,1,4922,1.0,0,3,0,-1.0
2,220674,33159,51444,70363,1,0,2,25390,1.0,0,3,0,-1.0
3,220674,33110,51395,70363,1,1,1,4859,1.0,0,3,0,-1.0
4,220674,33196,51481,70363,1,0,14,19813,1.0,3,4,0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
401751,291495,57830,108976,96299,0,1,1,38234,-1.0,0,2,0,-1.0
401752,291495,57843,109015,96299,0,1,1,6500,-1.0,0,0,0,-1.0
401753,291503,34577,54060,96299,0,1,1,18344,-1.0,0,3,0,-1.0
401754,291503,34577,54061,96299,0,1,1,12922,-1.0,0,2,0,-1.0
401755,291503,34577,54062,96299,0,0,9,36047,-1.0,1,3,0,0.0

In [52]:
df1 = all_data[all_data['ms_first_response'] > 0].reindex()
df1

,order_id,assignment_id,user_id,assistment_id,problem_id,original,correct,attempt_count,ms_first_response,tutor_mode,...,hint_count,hint_total,overlap_time,template_id,answer_id,answer_text,first_action,bottom_hint,opportunity,opportunity_original
0,33022537,277618,64525,33139,51424,1,1,1,32454,tutor,...,0,3,32454,30799,NaN,26,0,NaN,1,1.0
1,33022709,277618,64525,33150,51435,1,1,1,4922,tutor,...,0,3,4922,30799,NaN,55,0,NaN,2,2.0
2,35450204,220674,70363,33159,51444,1,0,2,25390,tutor,...,0,3,42000,30799,NaN,88,0,NaN,1,1.0
3,35450295,220674,70363,33110,51395,1,1,1,4859,tutor,...,0,3,4859,30059,NaN,41,0,NaN,2,2.0
4,35450311,220674,70363,33196,51481,1,0,14,19813,tutor,...,3,4,124564,30060,NaN,65,0,0.0,3,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
401751,38214014,291495,96299,57830,108976,0,1,1,38234,tutor,...,0,2,38234,55692,200260.0,NaN,0,NaN,54,NaN
401752,38214016,291495,96299,57843,109015,0,1,1,6500,tutor,...,0,0,6500,55693,200299.0,NaN,0,NaN,55,NaN
401753,38214195,291503,96299,34577,54060,0,1,1,18344,tutor,...,0,3,18344,30677,NaN,0.8,0,NaN,56,NaN
401754,38214196,291503,96299,34577,54061,0,1,1,12922,tutor,...,0,2,12922,30677,NaN,-6,0,NaN,57,NaN
401755,38214198,291503,96299,34577,54062,0,0,9,36047,tutor,...,1,3,163422,30677,NaN,-6.8,0,0.0,58,NaN

In [53]:
dfg1 = df1.groupby(["user_id","problem_id","assignment_id"])
list(dfg1["skill_id"])

64525, 80682, 277535),
  174019    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80686, 270579),
  173984    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80706, 277535),
  174016    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80714, 270579),
  173979    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80715, 270579),
  338052   NaN
  Name: skill_id, dtype: float64),
 ((64525, 80716, 270579),
  338053   NaN
  Name: skill_id, dtype: float64),
 ((64525, 80717, 270579),
  338054   NaN
  Name: skill_id, dtype: float64),
 ((64525, 80718, 277535),
  174015    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80719, 277535),
  338071   NaN
  Name: skill_id, dtype: float64),
 ((64525, 80720, 277535),
  338072   NaN
  Name: skill_id, dtype: float64),
 ((64525, 80721, 277535),
  338073   NaN
  Name: skill_id, dtype: float64),
 ((64525, 80734, 277535),
  174018    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80738, 270579),
  173980    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80738, 277535),
  174013    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80739, 277535),
  338068   NaN
  Name: skill_id, dtype: float64),
 ((64525, 80740, 277535),
  338069   NaN
  Name: skill_id, dtype: float64),
 ((64525, 80741, 277535),
  338070   NaN
  Name: skill_id, dtype: float64),
 ((64525, 80818, 277535),
  174011    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80819, 277535),
  338065   NaN
  Name: skill_id, dtype: float64),
 ((64525, 80820, 277535),
  338066   NaN
  Name: skill_id, dtype: float64),
 ((64525, 80821, 277535),
  338067   NaN
  Name: skill_id, dtype: float64),
 ((64525, 80862, 270579),
  173981    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80870, 277535),
  174010    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80878, 270579),
  173983    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80882, 270579),
  173978    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80882, 277535),
  174014    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80890, 277535),
  174031    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80902, 270579),
  173982    75.0
  Name: skill_id, dtype: float64),
 ((64525, 80902, 277535),
  174012    75.0
  Name: skill_id, dtype: float64),
 ((64525, 81169, 277562),
  71300    27.0
  Name: skill_id, dtype: float64),
 ((64525, 81204, 277563),
  71306    27.0
  Name: skill_id, dtype: float64),
 ((64525, 84605, 270575),
  284026    309.0
  Name: skill_id, dtype: float64),
 ((64525, 84671, 270591),
  182698    77.0
  Name: skill_id, dtype: float64),
 ((64525, 84677, 270591),
  182699    77.0
  Name: skill_id, dtype: float64),
 ((64525, 84722, 277501),
  93393    47.0
  Name: skill_id, dtype: float64),
 ((64525, 84724, 270544),
  93385    47.0
  Name: skill_id, dtype: float64),
 ((64525, 84788, 270544),
  93388    47.0
  Name: skill_id, dtype: float64),
 ((64525, 84817, 270537),
  136940    58.0
  208394    85.0
  Name: skill_id, dtype: float64),
 ((64525, 84838, 277501),
  93392    47.0
  Name: skill_id, dtype: float64),
 ((64525, 84930, 277501),
  93394    47.0
  Name: skill_id, dtype: float64),
 ((64525, 84938, 270544),
  93386    47.0
  Name: skill_id, dtype: float64),
 ((64525, 84951, 270544),
  93384    47.0
  Name: skill_id, dtype: float64),
 ((64525, 84974, 270544),
  93387    47.0
  Name: skill_id, dtype: float64),
 ((64525, 85015, 277547),
  182710    77.0
  Name: skill_id, dtype: float64),
 ((64525, 85061, 270591),
  182701    77.0
  Name: skill_id, dtype: float64),
 ((64525, 85110, 277531),
  284028    309.0
  Name: skill_id, dtype: float64),
 ((64525, 85216, 270591),
  182700    77.0
  Name: skill_id, dtype: float64),
 ((64525, 85366, 277493),
  136947    58.0
  208396    85.0
  Name: skill_id, dtype: float64),
 ((64525, 85582, 270586),
  203049    82.0
  Name: skill_id, dtype: float64),
 ((64525, 85586, 270586),
  203050    82.0
  Name: skill_id, dtype: float64),
 ((64525, 85588, 277542),
  203055    82.0
  Name: skill_id, dtype: float64),
 ((64525, 85593, 270586),
  203046    82.0
  Name: skill_id, dtype: float64),
 ((64525, 85600, 277542),
  203054    82.0
  Name: skill_id, dtype: float64),
 ((64525, 85625, 270586),
  203048    82.0
  Name: skill_id, dtype: float64),
 ((64525, 85707, 277500),
  115074    49.0
  Name: skill_id, dtype: float64),
 ((64525, 85714, 270543),
  115070    49.0
  Name: skill_id, dtype: float64),
 ((64525, 85826, 270545),
  93389    47.0
  Name: skill_id, dtype: float64),
 ((64525, 85849, 277502),
  93395    47.0
  Name: skill_id, dtype: float64),
 ((64525, 85934, 277503),
  93396    47.0
  Name: skill_id, dtype: float64),
 ((64525, 86054, 270546),
  93390    47.0
  Name: skill_id, dtype: float64),
 ((64525, 86102, 270549),
  156801    70.0
  Name: skill_id, dtype: float64),
 ((64525, 86118, 277506),
  156806    70.0
  Name: skill_id, dtype: float64),
 ((64525, 86143, 277519),
  147890    65.0
  Name: skill_id, dtype: float64),
 ((64525, 86149, 277519),
  147893    65.0
  Name: skill_id, dtype: float64),
 ((64525, 86157, 270563),
  147886    65.0
  Name: skill_id, dtype: float64),
 ((64525, 86160, 270563),
  147887    65.0
  Name: skill_id, dtype: float64),
 ((64525, 86163, 277519),
  147892    65.0
  Name: skill_id, dtype: float64),
 ((64525, 86173, 277519),
  147891    65.0
  Name: skill_id, dtype: float64),
 ((64525, 86188, 270562),
  147885    65.0
  Name: skill_id, dtype: float64),
 ((64525, 86200, 270562),
  147884    65.0
  Name: skill_id, dtype: float64),
 ((64525, 86203, 277518),
  147888    65.0
  Name: skill_id, dtype: float64),
 ((64525, 86227, 277518),
  147889    65.0
  Name: skill_id, dtype: float64),
 ((64525, 86239, 277541),
  199442    80.0
  Name: skill_id, dtype: float64),
 ((64525, 86241, 277541),
  199441    80.0
  Name: skill_id, dtype: float64),
 ((64525, 86247, 277541),
  199439    80.0
  Name: skill_id, dtype: float64),
 ((64525, 86330, 277497),
  259821    280.0
  Name: skill_id, dtype: float64),
 ((64525, 86367, 270585),
  199438    80.0
  Name: skill_id, dtype: float64),
 ((64525, 86370, 277541),
  199440    80.0
  Name: skill_id, dtype: float64),
 ((64525, 86468, 277567),
  87813    46.0
  Name: skill_id, dtype: float64),
 ((64525, 86485, 277567),
  87808    46.0
  Name: skill_id, dtype: float64),
 ((64525, 86490, 277567),
  87809    46.0
  Name: skill_id, dtype: float64),
 ((64525, 86497, 277567),
  87811    46.0
  Name: skill_id, dtype: float64),
 ((64525, 86549, 270540),
  259818    280.0
  Name: skill_id, dtype: float64),
 ((64525, 86559, 277567),
  87812    46.0
  Name: skill_id, dtype: float64),
 ((64525, 86582, 277545),
  190417    79.0
  Name: skill_id, dtype: float64),
 ((64525, 86635, 270589),
  190404    79.0
  Name: skill_id, dtype: float64),
 ((64525, 86641, 270589),
  190403    79.0
  Name: skill_id, dtype: float64),
 ((64525, 86666, 277550),
  259823    280.0
  Name: skill_id, dtype: float64),
 ((64525, 86709, 270589),
  190406    79.0
  Name: skill_id, dtype: float64),
 ((64525, 86712, 270589),
  190405    79.0
  Name: skill_id, dtype: float64),
 ((64525, 86759, 270594),
  259820    280.0
  Name: skill_id, dtype: float64),
 ((64525, 86778, 277521),
  151137    67.0
  Name: skill_id, dtype: float64),
 ((64525, 86895, 270565),
  151135    67.0
  Name: skill_id, dtype: float64),
 ((64525, 86938, 270590),
  190407    79.0
  Name: skill_id, dtype: float64),
 ((64525, 86941, 277546),
  190418    79.0
  Name: skill_id, dtype: float64),
 ((64525, 87045, 270551),
  141635    61.0
  Name: skill_id, dtype: float64),
 ((64525, 87128, 277508),
  141636    61.0
  Name: skill_id, dtype: float64),
 ((64525, 87154, 270596),
  199728    81.0
  Name: skill_id, dtype: float64),
 ((64525, 87244, 277552),
  199730    81.0
  Name: skill_id, dtype: float64),
 ((64525, 87267, 270587),
  190398    79.0
  Name: skill_id, dtype: float64),
 ((64525, 87286, 277543),
  190416    79.0
  Name: skill_id, dtype: float64),
 ((64525, 87311, 270587),
  190400    79.0
  Name: skill_id, dtype: float64),
 ((64525, 87315, 270587),
  190399    79.0
  Name: skill_id, dtype: float64),
 ((64525, 87317, 277543),
  190415    79.0
  Name: skill_id, dtype: float64),
 ((64525, 87321, 277543),
  190414    79.0
  Name: skill_id, dtype: float64),
 ((64525, 87341, 270587),
  190401    79.0
  Name: skill_id, dtype: float64),
 ((64525, 87349, 270587),
  190402    79.0
  Name: skill_id, dtype: float64),
 ((64525, 87356, 277543),
  190412    79.0
  Name: skill_id, dtype: float64),
 ((64525, 87362, 277543),
  190413    79.0
  Name: skill_id, dtype: float64),
 ((64525, 87425, 270557),
  204949    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87425, 277514),
  204957    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87428, 277514),
  204964    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87443, 277514),
  204958    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87450, 270557),
  204951    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87460, 270557),
  204954    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87461, 270557),
  204941    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87462, 270557),
  204950    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87468, 270557),
  204956    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87468, 277514),
  204962    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87471, 270557),
  204943    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87498, 277650),
  291766    311.0
  Name: skill_id, dtype: float64),
 ((64525, 87512, 270557),
  204947    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87517, 270557),
  204948    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87520, 277514),
  204960    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87532, 277514),
  204968    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87536, 277514),
  204971    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87537, 277514),
  204963    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87538, 270557),
  204944    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87540, 277514),
  204959    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87552, 277514),
  204967    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87560, 270557),
  204940    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87563, 270557),
  204946    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87567, 270557),
  204952    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87583, 277514),
  204970    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87585, 277514),
  204965    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87589, 277514),
  204961    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87590, 270557),
  204945    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87594, 277514),
  204969    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87596, 270557),
  204953    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87597, 270557),
  204942    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87599, 277514),
  204966    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87601, 270557),
  204955    83.0
  Name: skill_id, dtype: float64),
 ((64525, 87677, 277505),
  78181    34.0
  Name: skill_id, dtype: float64),
 ((64525, 87764, 277653),
  291770    311.0
  Name: skill_id, dtype: float64),
 ((64525, 87777, 270548),
  78180     34.0
  199727    81.0
  Name: skill_id, dtype: float64),
 ((64525, 87791, 277653),
  291772    311.0
  Name: skill_id, dtype: float64),
 ((64525, 87817, 277653),
  291771    311.0
  Name: skill_id, dtype: float64),
 ((64525, 87868, 277653),
  291769    311.0
  Name: skill_id, dtype: float64),
 ((64525, 87966, 270581),
  207743    84.0
  Name: skill_id, dtype: float64),
 ((64525, 88029, 277652),
  291768    311.0
  Name: skill_id, dtype: float64),
 ((64525, 88066, 277537),
  207749    84.0
  Name: skill_id, dtype: float64),
 ((64525, 88070, 277537),
  207747    84.0
  Name: skill_id, dtype: float64),
 ((64525, 88075, 277537),
  207745    84.0
  Name: skill_id, dtype: float64),
 ((64525, 88082, 277537),
  207744    84.0
  Name: skill_id, dtype: float64),
 ((64525, 88087, 277537),
  207748    84.0
  Name: skill_id, dtype: float64),
 ((64525, 88123, 277651),
  291767    311.0
  Name: skill_id, dtype: float64),
 ((64525, 88208, 277544),
  215521    86.0
  Name: skill_id, dtype: float64),
 ((64525, 88284, 270588),
  215519    86.0
  Name: skill_id, dtype: float64),
 ((64525, 88324, 277668),
  291784    311.0
  Name: skill_id, dtype: float64),
 ((64525, 88430, 270584),
  135979    54.0
  Name: skill_id, dtype: float64),
 ((64525, 88493, 277540),
  135980    54.0
  Name: skill_id, dtype: float64),
 ((64525, 88521, 270550),
  233029    276.0
  Name: skill_id, dtype: float64),
 ((64525, 88624, 277507),
  233030    276.0
  Name: skill_id, dtype: float64),
 ((64525, 88963, 277554),
  68897    24.0
  Name: skill_id, dtype: float64),
 ((64525, 89175, 277569),
  67145    21.0
  Name: skill_id, dtype: float64),
 ((64525, 89360, 277683),
  84211    39.0
  Name: skill_id, dtype: float64),
 ((64525, 89472, 277693),
  85360    40.0
  Name: skill_id, dtype: float64),
 ((64525, 89608, 277548),
  174032    75.0
  Name: skill_id, dtype: float64),
 ((64525, 89682, 270592),
  173985    75.0
  Name: skill_id, dtype: float64),
 ((64525, 89706, 270558),
  235007    277.0
  Name: skill_id, dtype: float64),
 ((64525, 89737, 263328),
  235006    277.0
  Name: skill_id, dtype: float64),
 ((64525, 89746, 277495),
  235010    277.0
  Name: skill_id, dtype: float64),
 ((64525, 89779, 277677),
  280099    303.0
  Name: skill_id, dtype: float64),
 ((64525, 89863, 263327),
  235005    277.0
  Name: skill_id, dtype: float64),
 ((64525, 89923, 277517),
  235011    277.0
  Name: skill_id, dtype: float64),
 ((64525, 89953, 270561),
  235008    277.0
  Name: skill_id, dtype: float64),
 ((64525, 90165, 277681),
  278619    301.0
  Name: skill_id, dtype: float64),
 ((64525, 90179, 277515),
  252782    279.0
  Name: skill_id, dtype: float64),
 ((64525, 90210, 263330),
  252773    279.0
  Name: skill_id, dtype: float64),
 ((64525, 90237, 270559),
  252777    279.0
  Name: skill_id, dtype: float64),
 ((64525, 90498, 263326),
  252772    279.0
  Name: skill_id, dtype: float64),
 ((64525, 90531, 277516),
  252783    279.0
  Name: skill_id, dtype: float64),
 ((64525, 90639, 270560),
  252778    279.0
  Name: skill_id, dtype: float64),
 ((64525, 90671, 277664),
  219107    92.0
  Name: skill_id, dtype: float64),
 ((64525, 90957, 277667),
  227970    96.0
  Name: skill_id, dtype: float64),
 ((64525, 90996, 277657),
  226437    94.0
  Name: skill_id, dtype: float64),
 ((64525, 91104, 277629),
  35147    13.0
  Name: skill_id, dtype: float64),
 ((64525, 91256, 277694),
  87123    42.0
  Name: skill_id, dtype: float64),
 ((64525, 91352, 277690),
  274365    296.0
  Name: skill_id, dtype: float64),
 ((64525, 91466, 277537),
  207746    84.0
  Name: skill_id, dtype: float64),
 ((64525, 92320, 270591),
  3969       2.0
  156803    70.0
  Name: skill_id, dtype: float64),
 ((64525, 92327, 277547),
  3971       2.0
  156809    70.0
  Name: skill_id, dtype: float64),
 ((64525, 92335, 270591),
  3970       2.0
  156805    70.0
  Name: skill_id, dtype: float64),
 ((64525, 92462, 277628),
  42851    15.0
  Name: skill_id, dtype: float64),
 ((64525, 92969, 277570),
  272026    293.0
  Name: skill_id, dtype: float64),
 ((64525, 92987, 277570),
  271141    290.0
  Name: skill_id, dtype: float64),
 ((64525, 93005, 277570),
  271140    290.0
  Name: skill_id, dtype: float64),
 ((64525, 93017, 277570),
  271599    292.0
  Name: skill_id, dtype: float64),
 ((64525, 93106, 277626),
  10167    4.0
  Name: skill_id, dtype: float64),
 ((64525, 93197, 277645),
  26385    11.0
  Name: skill_id, dtype: float64),
 ((64525, 93318, 277642),
  230718    105.0
  Name: skill_id, dtype: float64),
 ((64525, 93429, 277619),
  3975       2.0
  80763     37.0
  112124    48.0
  182714    77.0
  Name: skill_id, dtype: float64),
 ((64525, 93432, 277619),
  3972       2.0
  80760     37.0
  112121    48.0
  182711    77.0
  Name: skill_id, dtype: float64),
 ((64525, 93447, 277619),
  3973       2.0
  80761     37.0
  112122    48.0
  182712    77.0
  Name: skill_id, dtype: float64),
 ((64525, 93448, 277619),
  3974       2.0
  80762     37.0
  112123    48.0
  182713    77.0
  Name: skill_id, dtype: float64),
 ((64525, 93555, 277644),
  15725     9.0
  42854    15.0
  Name: skill_id, dtype: float64),
 ((64525, 93647, 277624),
  46876    16.0
  Name: skill_id, dtype: float64),
 ((64525, 93728, 277622),
  51744    17.0
  Name: skill_id, dtype: float64),
 ((64525, 93765, 277622),
  51745    17.0
  Name: skill_id, dtype: float64),
 ((64525, 93780, 277622),
  51746    17.0
  Name: skill_id, dtype: float64),
 ((64525, 93788, 277622),
  51743    17.0
  Name: skill_id, dtype: float64),
 ((64525, 93857, 277672),
  218462    91.0
  Name: skill_id, dtype: float64),
 ((64525, 94668, 277660),
  291783    311.0
  Name: skill_id, dtype: float64),
 ((64525, 94868, 270591),
  156804    70.0
  Name: skill_id, dtype: float64),
 ((64525, 94900, 277547),
  156808    70.0
  Name: skill_id, dtype: float64),
 ((64525, 94999, 277567),
  87810    46.0
  Name: skill_id, dtype: float64),
 ((64525, 97639, 277654),
  291773    311.0
  Name: skill_id, dtype: float64),
 ((64525, 97788, 270570),
  122391    50.0
  Name: skill_id, dtype: float64),
 ((64525, 97824, 270570),
  122393    50.0
  Name: skill_id, dtype: float64),
 ((64525, 97828, 270570),
  122392    50.0
  Name: skill_id, dtype: float64),
 ((64525, 97828, 277526),
  122399    50.0
  Name: skill_id, dtype: float64),
 ((64525, 97836, 270570),
  122389    50.0
  Name: skill_id, dtype: float64),
 ((64525, 97864, 277526),
  122396    50.0
  Name: skill_id, dtype: float64),
 ((64525, 97868, 277526),
  122397    50.0
  Name: skill_id, dtype: float64),
 ((64525, 97884, 270570),
  122390    50.0
  Name: skill_id, dtype: float64),
 ((64525, 97896, 277526),
  122398    50.0
  Name: skill_id, dtype: float64),
 ((64525, 97912, 277526),
  122400    50.0
  Name: skill_id, dtype: float64),
 ((64525, 107674, 277656),
  291781    311.0
  Name: skill_id, dtype: float64),
 ((64525, 107689, 277656),
  291779    311.0
  Name: skill_id, dtype: float64),
 ((64525, 107795, 277656),
  291780    311.0
  Name: skill_id, dtype: float64),
 ((64525, 107844, 277656),
  291778    311.0
  Name: skill_id, dtype: float64),
 ((64525, 107851, 277656),
  291774    311.0
  Name: skill_id, dtype: float64),
 ((64525, 107852, 277656),
  291775    311.0
  Name: skill_id, dtype: float64),
 ((64525, 107853, 277656),
  291776    311.0
  Name: skill_id, dtype: float64),
 ((64525, 107854, 277656),
  291777    311.0
  Name: skill_id, dtype: float64),
 ((64525, 107872, 277656),
  291782    311.0
  Name: skill_id, dtype: float64),
 ((64525, 107900, 277655),
  316043    312.0
  Name: skill_id, dtype: float64),
 ((64525, 107902, 277655),
  316044    312.0
  Name: skill_id, dtype: float64),
 ((64525, 107903, 277655),
  316045    312.0
  Name: skill_id, dtype: float64),
 ((64525, 107904, 277655),
  316046    312.0
  Name: skill_id, dtype: float64),
 ((64525, 107905, 277655),
  316050    312.0
  Name: skill_id, dtype: float64),
 ((64525, 107955, 277655),
  229279    101.0
  Name: skill_id, dtype: float64),
 ((64525, 108005, 277655),
  316051    312.0
  Name: skill_id, dtype: float64),
 ((64525, 108162, 277655),
  229280    101.0
  Name: skill_id, dtype: float64),
 ((64525, 108222, 277655),
  316049    312.0
  Name: skill_id, dtype: float64),
 ((64525, 108288, 277655),
  316047    312.0
  Name: skill_id, dtype: float64),
 ((64525, 108289, 277655),
  316048    312.0
  Name: skill_id, dtype: float64),
 ((64525, 108924, 270556),
  182695    77.0
  Name: skill_id, dtype: float64),
 ((64525, 108939, 277513),
  182707    77.0
  Name: skill_id, dtype: float64),
 ((64525, 108942, 277513),
  182702    77.0
  Name: skill_id, dtype: float64),
 ((64525, 108944, 277513),
  338060   NaN
  Name: skill_id, dtype: float64),
 ((64525, 108957, 270556),
  182697    77.0
  Name: skill_id, dtype: float64),
 ...]

In [49]:
a,b = dfg1.groups[(14, 57647, 263600)][0],dfg1.groups[(14, 57647, 263600)][1]
a,b,df1.iloc[a],df1.iloc[b]

(3966,
 112118,
 order_id                      21617749
 assignment_id                   263600
 user_id                             14
 assistment_id                    36822
 problem_id                       57647
 original                             1
 correct                              0
 attempt_count                        0
 ms_first_response                82572
 tutor_mode                       tutor
 answer_type                    algebra
 sequence_id                       5916
 student_class_id                 12495
 position                             2
 type                    MasterySection
 base_sequence_id                  5916
 skill_id                           2.0
 skill_name                Circle Graph
 teacher_id                       42972
 school_id                            1
 hint_count                           0
 hint_total                           0
 overlap_time                     82572
 template_id                      30397
 answer_id                          NaN
 answer_text                        NaN
 first_action                         2
 bottom_hint                        NaN
 opportunity                         10
 opportunity_original              10.0
 Name: 3966, dtype: object,
 order_id                            32833316
 assignment_id                         277456
 user_id                                71740
 assistment_id                          36832
 problem_id                             57677
 original                                   1
 correct                                    0
 attempt_count                              1
 ms_first_response                      15625
 tutor_mode                             tutor
 answer_type                          algebra
 sequence_id                             5898
 student_class_id                       11816
 position                                 249
 type                          MasterySection
 base_sequence_id                        5898
 skill_id                                48.0
 skill_name              Equivalent Fractions
 teacher_id                             22763
 school_id                                 73
 hint_count                                 0
 hint_total                                 0
 overlap_time                           15637
 template_id                            30397
 answer_id                                NaN
 answer_text                              300
 first_action                               0
 bottom_hint                              NaN
 opportunity                               10
 opportunity_original                    10.0
 Name: 112193, dtype: object)

In [ ]:
from tqdm import tqdm
for index, row in tqdm(filtered_data.iterrows()):
    if row['skill_id'] == -1:
        continue
    if row['skill_id'] not in skills:

        
        skills.append(int(row['skill_id']))
    if row['user_id'] not in users_id:
        users_id.append(int(row['user_id']))
    if row['user_id'] in students:
        students[row['user_id']].append(
            row[selected_features].values.tolist())
    else:
        students[row['user_id']] = [
            row[selected_features].values.tolist()]

In [46]:
pickle_data = {}

In [ ]:
import pickle
pickle_data['students'] = students
pickle_data['skills'] = skills
pickle_data['users_id'] = users_id
pickling_on = open("students.pickle", "wb")
pickle.dump(pickle_data, pickling_on)
pickling_on.close()

In [ ]:
for user_id in users_id:
    if len(students[user_id]) > max_steps:
        max_steps = len(students[user_id])
    if len(students[user_id]) < min_steps:
        min_steps = len(students[user_id])
    if len(students[user_id]) <= 2:
        del students[user_id]
    else:
        students_list.append(students[user_id])

In [44]:
print('Max step:', max_steps)
print('Num of skills:', len(skills))
print('Num of students:', len(users_id))
# np.array([List_s1[[],[],[]],List_s2[[][][]]],...,List_s3[[][]]])

Max step: -1
Num of skills: 0
Num of students: 0

In [ ]:
students_list[0]

In [ ]:
import seaborn as sns

In [ ]:
sns.distplot(x=filtered_data["skill_id"],hue="correct")

In [ ]:
 dat = DATA_RAW(n_question=params.n_question,
                   seqlen=200, separate_char=',')

In [ ]:
filtered_data["skill_id"].unique().shape

In [ ]:
sns.countplot(x = 'correct', data = filtered_data)